Repository: bbrito0/NeuroApp
Catalog: lib/l10n/app_*.arb
Languages: pt

# categoryFocus
source: Focus
pt: Foco

# categoryProblem
source: Problem
pt: Problema

source: Progress Overview
pt: Resumo do Progresso

source: See Details
pt: Ver Detalhes

source: My Goals
pt: Os Meus Objectivos

source: Edit Goals
pt: Editar Objectivos

# memoryGoalTitle
source: Improve short-term memory by 20%
pt: Melhorar a memória de curto prazo em 20%

# focusGoalTitle
source: Maintain focus for longer periods
pt: Manter o foco durante períodos mais longos

# problemSolvingGoalTitle
source: Master complex pattern recognition
pt: Dominar o reconhecimento de padrões complexos

# targetScore
source: Target Score: {score}
pt: Pontuação Alvo: {score}

source: Community Hub
pt: Central da Comunidade

source: Profile Settings
pt: Definições do Perfil

# cancelButton
source: Cancel
pt: Cancelar

# saveButton
source: Save
pt: Guardar

# currentGoal
source: Current Goal: {goal}
pt: Objectivo Actual: {goal}

source: Enter your goal
pt: Introduza o seu objectivo

# targetScoreLabel
source: Target Score:
pt: Pontuação Alvo:

# activitiesScreen
source: Activities
pt: Actividades

source: Featured Activities
pt: Actividades em Destaque

# cognitiveAssessmentTitle
source: Cognitive Assessment
pt: Avaliação Cognitiva

# cognitiveAssessmentDesc
source: Test and improve your cognitive abilities
pt: Teste e melhore as suas capacidades cognitivas

# meditationTitle
source: Meditation
pt: Meditação

# meditationDesc
source: Practice mindfulness and relaxation
pt: Pratique atenção plena e relaxamento

# learningResourcesTitle
source: Learning Resources
pt: Recursos de Aprendizagem

# learningResourcesDesc
source: Explore educational content and guides
pt: Explore conteúdos educativos e guias

source: Latest Report
pt: Relatório Mais Recente

# reportDate
source: March 15, 2024
pt: 15 de Março de 2024

# viewButton
source: View
pt: Visualizar

source: Available Now
pt: Disponível Agora

source: Unavailable
pt: Indisponível

# scheduleButton
source: Schedule
pt: Agendar

# joinButton
source: Join
pt: Participar

source: Family Medical History
pt: Histórico Médico Familiar

# lastUpdated
source: Last updated: {date}
pt: Última atualização: {date}

# editButton
source: Edit
pt: Editar

# meetingTime
source: {date} at {time}
pt: {date} às {time}

# reviews
source: {count} reviews
pt: {count} avaliações

# aiHealthCoachTitle
source: AI Health Coach
pt: Coach de IA para Saúde

# typeMessage
source: Type your message...
pt: Escreva a sua mensagem...

# askMeAnything
source: Ask me anything about your health
pt: Pergunte-me o que quiser sobre a sua saúde

# tapVideoChat
source: Tap the Video Chat button for a face-to-face conversation
pt: Toque no botão de Videochamada para uma conversa cara-a-cara

# errorTitle
source: Error
pt: Erro

# videoCallError
source: Failed to start video call: {error}
pt: Falha ao iniciar videochamada: {error}

source: Today
pt: Hoje

source: Yesterday
pt: Ontem

# greeting
source: Hello! How can I help you with your health or cognitive training today?
pt: Olá! Como posso ajudar com a sua saúde ou treino cognitivo hoje?

# howAreYou
source: I'm functioning well, thank you! More importantly, how are you feeling today?
pt: Estou a funcionar bem, obrigado! Mas o mais importante: como se está a sentir hoje?

# meditationResponse
source: Meditation is a great practice for mental clarity and stress reduction. Would you like me to recommend some techniques or guide you through a quick session?
pt: A meditação é uma óptima prática para clareza mental e redução do stress. Gostaria que recomendasse algumas técnicas ou o(a) guiasse numa sessão rápida?

# sleepResponse
source: Sleep is crucial for cognitive function. I recommend establishing a consistent schedule, avoiding screens before bedtime, and creating a relaxing environment. Would you like more specific advice?
pt: O sono é essencial para o funcionamento cognitivo. Recomendo manter um horário regular, evitar ecrãs antes de dormir e criar um ambiente relaxante. Quer sugestões mais específicas?

# stressResponse
source: I'm sorry to hear you're feeling stressed. Deep breathing exercises, mindfulness, and physical activity can help manage stress. Would you like to know more about any of these approaches?
pt: Lamento saber que está a sentir-se stressado(a). Exercícios de respiração profunda, mindfulness e actividade física podem ajudar. Quer saber mais sobre alguma dessas opções?

# exerciseResponse
source: Regular exercise is great for both physical and mental health! Even 30 minutes of moderate activity daily can make a significant difference. What type of exercises do you enjoy?
pt: O exercício regular é óptimo para a saúde física e mental! Mesmo 30 minutos de actividade moderada por dia fazem uma grande diferença. Que tipo de exercício prefere?

# dietResponse
source: A balanced diet rich in fruits, vegetables, whole grains, and lean proteins supports cognitive function. Omega-3 fatty acids found in fish, walnuts, and flaxseeds are particularly beneficial for brain health.
pt: Uma alimentação equilibrada, rica em frutas, vegetais, cereais integrais e proteínas magras, ajuda a função cognitiva. Os ómega-3, presentes em peixe, nozes e linhaça, são especialmente benéficos.

# gameResponse
source: Cognitive games and puzzles are excellent for keeping your mind sharp! Our app offers several challenges designed to improve memory, focus, and problem-solving skills. Would you like to try one?
pt: Jogos cognitivos e quebra-cabeças são excelentes para manter a mente activa! A nossa app tem vários desafios desenhados para melhorar memória, foco e resolução de problemas. Quer experimentar um?

# thankYouResponse
source: You're welcome! I'm here to help anytime you need assistance or have questions about your cognitive health.
pt: De nada! Estou aqui para ajudar sempre que precisar de apoio ou tiver dúvidas sobre a sua saúde cognitiva.

# defaultResponse
source: That's an interesting point. Would you like to discuss how this relates to your cognitive health journey? I'm here to support you however I can.
pt: Esse é um ponto interessante. Quer explorar como isso se relaciona com a sua jornada de saúde cognitiva? Estou aqui para apoiar.

# initialGreeting
source: Hello {name}, how can I help you today?
pt: Olá {name}, como posso ajudar hoje?

source: Community
pt: Comunidade

source: Search topics
pt: Pesquisar tópicos

# tagMemory
source: Memory
pt: Memória

# tagTraining
source: Training
pt: Treino

# tagHealth
source: Health
pt: Saúde

# tagTips
source: Tips
pt: Dicas

# tagProgress
source: Progress
pt: Progresso

# tagExpert
source: Expert
pt: Especialista

source: Topic Title
pt: Título do Tópico

source: Write your post...
pt: Escreva a sua publicação...

source: Create Topic
pt: Criar Tópico

source: Post
pt: Publicar

# startNewGame
source: Start a new game!
pt: Inicie um novo jogo!

# watchPattern
source: Watch the pattern!
pt: Observe o padrão!

source: Your turn!
pt: A sua vez!

# incorrectPattern
source: Wrong pattern!
pt: Padrão incorrecto!

source: Try again
pt: Tente novamente

# levelUp
source: Level up to level {level}!
pt: Avançou para o nível {level}!

# correct
source: Correct! Well done!
pt: Correcto! Muito bem!

# level
source: Level: {level}
pt: Nível: {level}

source: Restart
pt: Reiniciar

source: Scan Supplement Code
pt: Digitalizar Código do Suplemento

# scanBarcodeSubtitle
source: Scan the barcode on your supplement bottle to automatically add it to your supplement list.
pt: Digitalize o código no frasco do suplemento para adicioná-lo automaticamente à sua lista.

# pointCameraBarcode
source: Point your camera at the barcode on your supplement package
pt: Aponte a câmara para o código na embalagem do suplemento

source: Enter Code Manually
pt: Inserir Código Manualmente

# noProductCode
source: I don't have a product code
pt: Não tenho código de produto

source: Enter Supplement Code
pt: Introduzir Código do Suplemento

source: Enter code here
pt: Digite o código aqui

source: Submit
pt: Submeter

source: Dev: Test Scan
pt: Dev: Teste de Digitalização

# supplementQuizTitle
source: Supplement Quiz
pt: Questionário de Suplementos

# supplementQuizSubtitle
source: Help us find the perfect supplements for your needs
pt: Ajude-nos a encontrar os suplementos ideais para si

# primaryHealthGoalQuestion
source: What is your primary health goal?
pt: Qual é o seu principal objectivo de saúde?

source: Improve cognitive function
pt: Melhorar a função cognitiva

source: Better sleep quality
pt: Melhor qualidade de sono

source: More energy
pt: Mais energia

source: Reduce stress/anxiety
pt: Reduzir stress/ansiedade

source: Overall health optimization
pt: Optimização geral da saúde

# symptomsQuestion
source: Do you currently experience any of these symptoms?
pt: Actualmente, tem algum destes sintomas?

# brainFogSymptom
source: Brain fog or poor concentration
pt: Névoa mental ou dificuldade de concentração

# lowEnergySymptom
source: Low energy or fatigue
pt: Falta de energia ou fadiga

# troubleSleepingSymptom
source: Trouble sleeping
pt: Dificuldade em dormir

# moodFluctuationsSymptom
source: Mood fluctuations
pt: Alterações de humor

# noSymptomsOption
source: None of the above
pt: Nenhum dos anteriores

# stressLevelQuestion
source: How would you describe your typical stress level?
pt: Como descreveria o seu nível habitual de stress?

# veryHighStress
source: Very high (constant stress)
pt: Muito alto (stress constante)

# highStress
source: High (frequent stress)
pt: Alto (stress frequente)

# moderateStress
source: Moderate (occasional stress)
pt: Moderado (stress ocasional)

# lowStress
source: Low (rarely stressed)
pt: Baixo (raramente stressado)

# veryLowStress
source: Very low (almost never stressed)
pt: Muito baixo (quase nunca stressado)

# sleepQualityQuestion
source: How is your typical sleep quality?
pt: Como classifica a sua qualidade habitual de sono?

# excellentSleep
source: Excellent (7-8+ hours uninterrupted)
pt: Excelente (7-8+ horas sem interrupções)

# goodSleep
source: Good (6-7 hours, few interruptions)
pt: Boa (6-7 horas, poucas interrupções)

# fairSleep
source: Fair (5-6 hours, some interruptions)
pt: Razoável (5-6 horas, algumas interrupções)

# poorSleep
source: Poor (less than 5 hours or very interrupted)
pt: Fraca (menos de 5 horas ou muito interrompido)

# veryPoorSleep
source: Very poor (significant sleep issues)
pt: Muito fraca (problemas de sono significativos)

# dietQuestion
source: How would you characterize your diet?
pt: Como descreveria a sua alimentação?

# veryHealthyDiet
source: Very healthy (whole foods, balanced meals)
pt: Muito saudável (alimentos integrais, refeições equilibradas)

# mostlyHealthyDiet
source: Mostly healthy with occasional indulgences
pt: Maioritariamente saudável com indulgências ocasionais

# averageDiet
source: Average (mix of healthy and processed foods)
pt: Média (mistura de saudável e processado)

# belowAverageDiet
source: Below average (mostly processed foods)
pt: Abaixo da média (principalmente processados)

# poorDiet
source: Poor (highly processed, unbalanced)
pt: Fraca (altamente processada, desequilibrada)

# supplementDosage
source: 2 capsules daily, preferably with food
pt: 2 cápsulas por dia, preferencialmente com alimentos

# supplementDescription
source: Premium cognitive enhancement supplement
pt: Suplemento premium para melhoria cognitiva

# benefitImprovedFocus
source: Improved focus and concentration
pt: Melhoria no foco e concentração

# benefitEnhancedMemory
source: Enhanced memory retention
pt: Melhor retenção de memória

# benefitReducedBrainFog
source: Reduced brain fog
pt: Redução da fadiga mental

# benefitIncreasedClarity
source: Increased mental clarity
pt: Maior clareza mental

# loadingAnalyzingProfile
source: Analyzing your health profile...
pt: A analisar o seu perfil de saúde...

# loadingPersonalizingPlan
source: Personalizing your supplement plan...
pt: A personalizar o seu plano de suplementos...

# loadingOptimizingTraining
source: Optimizing your cognitive training...
pt: A optimizar o seu treino cognitivo...

# loadingFinalizingExperience
source: Finalizing your experience...
pt: A finalizar a sua experiência...

# tipDidYouKnow
source: Did you know?
pt: Sabia que?

# tipHealthFact
source: Health Fact
pt: Facto de Saúde

# tipSupplementBenefit
source: Supplement Benefit
pt: Benefício do Suplemento

# tipWellnessTip
source: Wellness Tip
pt: Dica de Bem-estar

# tipBrainPower
source: Brain Power
pt: Poder Cerebral

# tipOmega3Content
source: Omega-3 fatty acids found in ChronoWell supplements support brain health and cognitive function.
pt: Os ácidos gordos ómega-3 presentes nos suplementos ChronoWell apoiam a saúde cerebral e a função cognitiva.

# tipCognitiveTrainingContent
source: Regular cognitive training can increase neuroplasticity, helping your brain form new neural connections.
pt: O treino cognitivo regular pode aumentar a neuroplasticidade, ajudando o seu cérebro a formar novas ligações neuronais.

# tipVitaminD3Content
source: Vitamin D3 in our supplements helps maintain cognitive function and reduces risk of cognitive decline.
pt: A vitamina D3 presente nos nossos suplementos ajuda a manter a função cognitiva e reduz o risco de declínio cognitivo.

# tipSleepContent
source: Combining ChronoWell supplements with 7-8 hours of quality sleep maximizes cognitive benefits.
pt: Combinar suplementos ChronoWell com 7-8 horas de sono de qualidade maximiza os benefícios cognitivos.

# tipBacopaContent
source: Bacopa Monnieri, a key ingredient in REVITA, has been shown to improve memory formation and recall.
pt: A Bacopa Monnieri, ingrediente chave no REVITA, demonstrou melhorar a formação e recuperação da memória.

# tipPersonalizedContent
source: Our personalized approach matches your specific cognitive needs with targeted supplement formulations.
pt: A nossa abordagem personalizada combina as suas necessidades cognitivas com formulações de suplementos direccionadas.
