Repository: bbrito0/NeuroApp
Catalog: lib/l10n/app_*.arb
Languages: pt

# welcomeTitle
source: Welcome to ChronoWell
pt: Bem-vindo(a) ao ChronoWell

# welcomeMessage
source: Your personal cognitive wellness companion on the journey to better mental fitness.
pt: O seu companheiro pessoal de bem-estar cognitivo na jornada para uma melhor saúde mental.

source: Get Started
pt: Começar

# welcomeCardTitle
source: You're making great progress!
pt: Está a fazer um excelente progresso!

# welcomeCardSubtitle
source: Yet I can see you still have not done your daily check-in. Ready to start?
pt: Parece que ainda não fez o seu check-in diário. Pronto(a) para começar?

source: Daily Challenges
pt: Desafios Diários

source: View All
pt: Ver Todos

source: Latest Updates
pt: Últimas Atualizações

source: Next
pt: Seguinte

source: Back
pt: Voltar

source: Finish
pt: Concluir

# continueAction
source: Continue
pt: Continuar

source: Settings
pt: Definições

source: Language
pt: Idioma

source: English
pt: Inglês

source: Spanish
pt: Espanhol

source: Portuguese
pt: Português

source: Cancel
pt: Cancelar

source: AI Coach
pt: Coach de IA

source: AI Insight
pt: Análise IA

source: AI Health Coach
pt: Coach de IA para Saúde

source: Welcome Back
pt: Bem-vindo(a) de volta

source: Today's Challenge
pt: Desafio de Hoje

source: Start Challenge
pt: Iniciar Desafio

# estimatedTime
source: Estimated time: 10-15 min
pt: Tempo estimado: 10-15 min

# recommendedTime
source: Recommended time: 8:00 AM
pt: Hora recomendada: 8:00

source: Create Account
pt: Criar Conta

# completeProfile
source: Complete your profile to get started with personalized health recommendations.
pt: Complete o seu perfil para começar a receber recomendações de saúde personalizadas.

source: Personal Information
pt: Informações Pessoais

# enterNameEmail
source: Please enter your name and email address
pt: Por favor, introduza o seu nome e e-mail

source: Full Name
pt: Nome Completo

source: Set Password
pt: Definir Palavra-passe

# createPassword
source: Create a secure password for your account
pt: Crie uma palavra-passe segura para a sua conta

source: Password
pt: Palavra-passe

# onboardingTitle
source: Welcome to ChronoWell
pt: Bem-vindo(a) ao ChronoWell

source: Skip
pt: Saltar

# continueScanCode
source: Continue to Scan Code
pt: Continuar para Digitalizar Código

# featurePersonalizedTitle
source: Personalized Features
pt: Funcionalidades Personalizadas

# featurePersonalizedDesc
source: All features are tailored to your supplementation plan and needs, helping you optimize your health journey
pt: Todas as funcionalidades são adaptadas ao seu plano de suplementação e necessidades, ajudando-o(a) a optimizar a sua jornada de saúde

# featureAICoachTitle
source: AI Coach
pt: Coach de IA

# featureAICoachDesc
source: Chat with your AI coach daily to share how you feel and get personalized recommendations based on your supplementation plan
pt: Converse diariamente com o seu coach de IA para partilhar como se sente e receber recomendações personalizadas com base no seu plano de suplementação

# featureMyHubTitle
source: My Hub
pt: O Meu Espaço

# featureMyHubDesc
source: Track your progress, set goals, and visualize your health journey with AI insights based on your supplement usage
pt: Acompanhe o seu progresso, defina objectivos e visualize a sua jornada de saúde com análises de IA baseadas no seu uso de suplementos

# featureCommunityTitle
source: Join the Community
pt: Junte-se à Comunidade

# featureCommunityDesc
source: Connect with others on similar health journeys to share experiences and find support
pt: Ligue-se a outras pessoas em jornadas de saúde semelhantes para partilhar experiências e encontrar apoio

# featureMedicalTitle
source: Medical Screen
pt: Ecrã Médico

# featureMedicalDesc
source: Keep your health profile updated, track your supplements, and receive care tailored to your personal needs
pt: Mantenha o seu perfil de saúde actualizado, acompanhe os seus suplementos e receba cuidados ajustados às suas necessidades

source: Meditation
pt: Meditação

# featuredMeditations
source: Featured Meditations This Week
pt: Meditações em Destaque Esta Semana

source: Mindful Breathing
pt: Respiração Consciente

# mindfulBreathingDesc
source: A gentle introduction to mindful breathing techniques for relaxation and focus.
pt: Uma introdução suave às técnicas de respiração consciente para relaxamento e concentração.

source: Body Scan
pt: Exploração Corporal

# bodyScanDesc
source: Progressive relaxation through a guided body awareness meditation.
pt: Relaxamento progressivo através de uma meditação guiada de consciência corporal.

source: Mental Clarity
pt: Clareza Mental

# mentalClarityDesc
source: Clear your mind and enhance focus with this guided meditation session.
pt: Limpe a mente e melhore a concentração com esta sessão de meditação guiada.

source: Stress Relief
pt: Alívio do Stress

# stressReliefDesc
source: Release tension and find inner peace with calming visualization techniques.
pt: Liberte a tensão e encontre paz interior com técnicas de visualização calmantes.

source: Deep Focus
pt: Foco Profundo

# deepFocusDesc
source: Enhance concentration and mental clarity for improved productivity.
pt: Melhore a concentração e a clareza mental para uma maior produtividade.

source: Profile
pt: Perfil

# trainingLabel
source: Training since Jan 2024
pt: A treinar desde Jan 2024

# daysLabel
source: Days
pt: Dias

# challengesLabel
source: Challenges
pt: Desafios

# meditationsLabel
source: Meditations
pt: Meditações

source: Account Settings
pt: Definições da Conta

source: Notifications
pt: Notificações

source: Privacy
pt: Privacidade

source: Help & Support
pt: Ajuda e Suporte

source: Resources
pt: Recursos

source: Search resources
pt: Pesquisar recursos

source: Categories
pt: Categorias

source: Memory
pt: Memória

source: Focus
pt: Foco

source: Speed
pt: Velocidade

source: Problem Solving
pt: Resolução de Problemas

source: Featured Articles
pt: Artigos em Destaque

source: Article
pt: Artigo

# minRead
source: {time} min read
pt: {minutes} min de leitura

# aiHealthAssistant
source: AI. Health Assistant APP
pt: Assistente de Saúde IA

source: Login
pt: Iniciar Sessão

source: New User
pt: Novo usuário? Comece aqui

source: Forgot password?
pt: Esqueceu-se da palavra-passe?

source: Complete Setup
pt: Concluir Configuração

# chooseHowToProceed
source: Choose how you want to proceed with ChronoWell
pt: Escolha como pretende continuar com o ChronoWell

source: Scan Product Code
pt: Digitalizar Código do Produto

# unlockPremiumFeatures
source: Unlock all premium features by scanning your supplement code
pt: Desbloqueie todas as funcionalidades premium ao digitalizar o código do seu suplemento

source: Continue with Limited Features
pt: Continuar com Funcionalidades Limitadas

# accessBasicFeatures
source: Access basic features without a product code
pt: Aceda a funcionalidades básicas sem um código de produto

# premiumFeaturesNote
source: Premium features include personalized AI coaching, advanced tracking, and tailored supplement recommendations.
pt: As funcionalidades premium incluem coaching de IA personalizado, monitorização avançada e recomendações de suplementos adaptadas às suas necessidades.

# analyzed
source: Analyzing your health profile...
pt: A analisar o seu perfil de saúde...

# personalizing
source: Personalizing your supplement plan...
pt: A personalizar o seu plano de suplementos...

# optimizing
source: Optimizing your cognitive training...
pt: A optimizar o seu treino cognitivo...

# finalizing
source: Finalizing your experience...
pt: A finalizar a sua experiência...

source: Setup Complete!
pt: Configuração Concluída!

source: Ready!
pt: Pronto!

source: Did you know?
pt: Sabia que?

source: Health Fact
pt: Facto de Saúde

source: Supplement Benefit
pt: Benefício dos Suplementos

source: Wellness Tip
pt: Dica de Bem-estar

source: Brain Power
pt: Poder Cerebral

source: Supplement Quiz
pt: Questionário de Suplementos

# helpUsFindSupplements
source: Help us find the perfect supplements for your needs
pt: Ajude-nos a encontrar os suplementos ideais para as suas necessidades

# question
source: Question {number} of {total}
pt: Pergunta {number} de {total}

source: See Results
pt: Ver Resultados

# supplementIdQuestion
source: What is your primary health goal?
pt: Qual é o seu principal objectivo de saúde?

# supplementSymptomQuestion
source: Do you currently experience any of these symptoms?
pt: Atualmente, sente algum destes sintomas?

# supplementStressQuestion
source: How would you describe your typical stress level?
pt: Como descreveria o seu nível típico de stress?

# supplementSleepQuestion
source: How is your typical sleep quality?
pt: Como classifica a sua qualidade de sono habitual?

# supplementDietQuestion
source: How would you characterize your diet?
pt: Como descreveria a sua alimentação?

source: Your Supplements
pt: Os Seus Suplementos

source: Review and manage
pt: Rever e gerir

# productCodePrefix
source: Product Code:
pt: Código do Produto:

# supplementIdentified
source: Supplement identified from your code
pt: Suplemento identificado através do seu código

source: Verified
pt: Verificado

source: Benefits
pt: Benefícios

source: Recommended Dosage
pt: Dosagem Recomendada

source: Add More Supplements
pt: Adicionar Mais Suplementos

source: Continue to Health Profile
pt: Continuar para o Perfil de Saúde

source: AI Coach Call
pt: Chamada com Coach de IA

# medicalScreen
source: Medical Portal
pt: Portal Médico

source: Medical Reports
pt: Relatórios Médicos

source: Caregiver Portal
pt: Portal do Cuidador

source: Upcoming Meetings
pt: Próximas Consultas

source: Medical History
pt: Histórico Médico

# medicalHistoryInfo
source: This questionnaire aims to gather health information to identify medical conditions, ensure proper care, and promote well-being.
pt: Forneça seu histórico médico para personalizar sua experiência.

source: Incomplete Information
pt: Informação Incompleta

# fillAllFields
source: Please fill in all fields to continue.
pt: Por favor, preencha todos os campos para continuar.

source: Activity Level Required
pt: Nível de Actividade Necessário

# selectActivityLevel
source: Please select your activity level to continue.
pt: Por favor, seleccione o seu nível de actividade para continuar.

source: Diet Type Required
pt: Tipo de Dieta Necessário

# selectDietType
source: Please select your diet type to continue.
pt: Por favor, seleccione o seu tipo de dieta para continuar.

source: Done
pt: Concluído

source: What is your age?
pt: Qual é a sua idade?

# ageHelpsPersonalize
source: This helps us personalize your health recommendations
pt: Isso ajuda-nos a personalizar as suas recomendações de saúde

source: Select age
pt: Seleccione a idade

source: Age
pt: Idade

source: What is your gender?
pt: Qual é o seu género?

source: Male
pt: Masculino

source: Female
pt: Feminino

# otherGender
source: Other
pt: Outro

source: What is your weight?
pt: Qual é o seu peso?

source: Select your weight
pt: Seleccione o seu peso

source: Weight
pt: Peso

source: What is your height?
pt: Qual é a sua altura?

source: Select your height
pt: Seleccione a sua altura

source: Height
pt: Altura

source: ft
pt: pés

# stepCount
source: Step {current} of {total}
pt: Passo {currentStep} de {totalSteps}

source: Activity Level
pt: Nível de Actividade

# selectYourActivityLevel
source: Select your typical activity level
pt: Seleccione o seu nível de actividade típico

source: Sedentary
pt: Sedentário

# sedentaryDesc
source: Little to no exercise
pt: Pouco ou nenhum exercício

source: Moderately Active
pt: Moderadamente Activo

# moderatelyActiveDesc
source: Light exercise 2-3 times a week
pt: Exercício leve 2-3 vezes por semana

source: Highly Active
pt: Altamente Activo

# highlyActiveDesc
source: Frequent intense exercise
pt: Exercício intenso frequente

source: Dietary Preferences
pt: Preferências Alimentares

# selectYourDietType
source: Select your primary diet type
pt: Seleccione o seu tipo de dieta principal

# ketoDesc
source: High-fat, low-carb diet
pt: Dieta rica em gorduras, baixa em hidratos de carbono

source: Vegan
pt: Vegana

# veganDesc
source: Plant-based diet without animal products
pt: Dieta à base de plantas sem produtos de origem animal

source: Balanced
pt: Equilibrada

# balancedDesc
source: Mixed diet with all food groups
pt: Dieta mista com todos os grupos alimentares

source: Other
pt: Outro

# specifyDiet
source: Specify your diet
pt: Especifique a sua dieta

# enterDietType
source: Enter your diet type
pt: Introduza o seu tipo de dieta

source: Profile Complete
pt: Perfil Completo

# profileCompleteDesc
source: Your health profile is now complete! We'll now set up your personalized experience.
pt: O seu perfil de saúde está completo! Agora vamos configurar a sua experiência personalizada.

# continueText
source: Continue
pt: Continuar

source: Medical Summary
pt: Resumo Médico

source: Symptoms Tracker
pt: Registo de Sintomas

source: Recent Activities
pt: Actividades Recentes

source: Progress Tracking
pt: Acompanhamento do Progresso

source: Heart Rate
pt: Frequência Cardíaca

source: Sleep Quality
pt: Qualidade do Sono

source: hours
pt: horas

source: Nutrition
pt: Nutrição

source: calories
pt: calorias

source: Steps
pt: Passos

# stepsUnit
source: steps
pt: passos

source: Medical Records
pt: Registos Médicos

# medicalHistorySummary
source: View your complete medical history, including doctor visits, test results, and treatment plans.
pt: Consulte o seu histórico médico completo, incluindo consultas, resultados de exames e planos de tratamento.

# routineCheckupDesc
source: Annual physical examination with vitals check and basic lab work.
pt: Exame físico anual com verificação de sinais vitais e análises laboratoriais básicas.

# specialist
source: Specialist Consultation
pt: Consulta com Especialista

# neurologistConsultationDesc
source: Neurological assessment and cognitive function testing.
pt: Avaliação neurológica e testes de função cognitiva.

source: Lab Test
pt: Análise Laboratorial

# bloodWorkDesc
source: Comprehensive blood panel including metabolic and lipid profiles.
pt: Painel sanguíneo completo incluindo perfis metabólicos e lipídicos.

source: Imaging
pt: Exame de Imagem

# brainScanDesc
source: MRI brain scan to evaluate neural structure and activity.
pt: Ressonância magnética ao cérebro para avaliar estrutura e actividade neural.

source: Therapy
pt: Terapia

# physicalTherapyDesc
source: Physical therapy session focusing on mobility and strength exercises.
pt: Sessão de fisioterapia focada em mobilidade e fortalecimento.

# premiumFeaturesDescription
source: Premium features include personalized AI coaching, advanced tracking, and tailored supplement recommendations.
pt: As funcionalidades premium incluem coaching de IA personalizado, acompanhamento avançado e recomendações de suplementos personalizadas.

source: Decision Recorded
pt: Decisão Registada

# decisionSummary
source: Your medical decision has been recorded and added to your health profile. Your healthcare provider has been notified.
pt: A sua decisão médica foi registada e adicionada ao seu perfil de saúde. O seu profissional de saúde foi notificado.

source: Next Steps
pt: Próximos Passos

source: Review Medical Plan
pt: Rever Plano Médico

# reviewMedicalPlanDesc
source: Go through your updated treatment plan in the Health Profile section.
pt: Consulte o seu plano de tratamento actualizado na secção Perfil de Saúde.

source: Schedule Follow-Up
pt: Agendar Acompanhamento

# scheduleFollowUpDesc
source: Book your next appointment with your healthcare provider.
pt: Agende a sua próxima consulta com o seu profissional de saúde.

source: Track Progress
pt: Acompanhar Progresso

# trackProgressDesc
source: Monitor your health metrics and symptoms in the Progress section.
pt: Monitorize as suas métricas de saúde e sintomas na secção Progresso.

source: My Hub
pt: O Meu Espaço

source: Modules
pt: Módulos

source: Activities
pt: Actividades

source: Progress
pt: Progresso

source: Recommended Modules
pt: Módulos Recomendados

source: Cognitive Fitness
pt: Aptidão Cognitiva

# cognitiveFitnessDesc
source: Brain exercises to improve memory, focus, and mental clarity.
pt: Exercícios cerebrais para melhorar a memória, o foco e a clareza mental.

source: Stress Management
pt: Gestão do Stress

# stressManagementDesc
source: Techniques to reduce stress and promote relaxation.
pt: Técnicas para reduzir o stress e promover o relaxamento.

source: All Modules
pt: Todos os Módulos

source: Sleep Improvement
pt: Melhoria do Sono

# sleepImprovementDesc
source: Strategies to optimize sleep quality and duration.
pt: Estratégias para optimizar a qualidade e duração do sono.

source: Nutrition Optimization
pt: Optimização Nutricional

# nutritionOptimizationDesc
source: Personalized nutrition plans for cognitive health.
pt: Planos alimentares personalizados para a saúde cognitiva.

source: Today's Activities
pt: Actividades de Hoje

source: Focus Exercise
pt: Exercício de Foco

# focusExerciseDesc
source: Attention training to improve concentration.
pt: Treino de atenção para melhorar a concentração.

source: minutes
pt: minutos

source: Pending
pt: Pendente

source: Mindfulness Session
pt: Sessão de Mindfulness

# mindfulnessSessionDesc
source: Guided meditation for mental clarity.
pt: Meditação guiada para clareza mental.

source: Completed
pt: Concluído

source: Upcoming Activities
pt: Actividades Futuras

source: Memory Challenge
pt: Desafio de Memória

# memoryChallengeDesc
source: Exercise to strengthen working memory.
pt: Exercício para fortalecer a memória de trabalho.

source: Tomorrow
pt: Amanhã

source: Sleep Journal
pt: Diário do Sono

# sleepJournalDesc
source: Record sleep patterns and quality.
pt: Registe os padrões e a qualidade do sono.

source: Weekly Progress
pt: Progresso Semanal

source: Activities Completed
pt: Actividades Concluídas

source: Focus Score
pt: Pontuação de Foco

source: Wellness Score
pt: Pontuação de Bem-estar

source: Streaks
pt: Sequências

source: Current Streak
pt: Sequência Actual

source: Longest Streak
pt: Maior Sequência

source: days
pt: dias

source: Cognitive Assessment
pt: Avaliação Cognitiva

# letsTrainBrain
source: Let's train your brain today!
pt: Vamos treinar o seu cérebro hoje!

source: Featured Challenges
pt: Desafios em Destaque

source: All Challenges
pt: Todos os Desafios

source: Featured
pt: Em Destaque

source: Start
pt: Começar

source: Memory Match
pt: Combinação de Memória

# memoryMatchDesc
source: Test your visual memory with card matching
pt: Teste a sua memória visual com combinação de cartas

source: Quick Reaction
pt: Reacção Rápida

# quickReactionDesc
source: Measure your response time to visual stimuli
pt: Meça o seu tempo de resposta a estímulos visuais

source: Pattern Quest
pt: Desafio de Padrões

# patternQuestDesc
source: Memorize and recreate complex patterns
pt: Memorize e recrie padrões complexos

source: Word Recall
pt: Recordação de Palavras

# wordRecallDesc
source: Test your ability to remember words
pt: Teste a sua capacidade de recordar palavras

source: Focus Timer
pt: Temporizador de Foco

# focusTimerDesc
source: Track and improve your attention span
pt: Acompanhe e melhore o seu tempo de atenção

source: Visual Puzzle
pt: Quebra-cabeças Visuais

# visualPuzzleDesc
source: Solve spatial reasoning challenges
pt: Resolva desafios de raciocínio espacial

source: Learning Resources
pt: Recursos de Aprendizagem

source: Explore
pt: Explorar

source: Memory Master
pt: Mestre da Memória

# enhanceMemorySkills
source: Enhance your memory skills
pt: Aperfeiçoe as suas capacidades de memória

# completeMemoryMatch
source: Complete Memory Match Game
pt: Conclua o Jogo de Memória

# readMemoryArticle
source: Read Memory Enhancement Article
pt: Leia o Artigo sobre Memória

# practiceVisualization
source: Practice Visualization Exercise
pt: Pratique Exercícios de Visualização

source: Focus Champion
pt: Campeão do Foco

# improveConcentration
source: Improve your concentration
pt: Melhore a sua concentração

# completeMeditation
source: Complete 10min Meditation
pt: Faça 10 min de Meditação

source: Practice Mindful Reading
pt: Pratique Leitura Consciente

# doFocusExercise
source: Do a Focus Exercise
pt: Realize um Exercício de Foco

source: Problem Solver
pt: Resolutor de Problemas

source: Boost analytical thinking
pt: Estimule o pensamento analítico

source: Complete Pattern Recognition
pt: Conclua o Reconhecimento de Padrões

source: Solve Daily Puzzle
pt: Resolva o Quebra-cabeças Diário

source: Read Logic Article
pt: Leia o Artigo sobre Lógica

# startChallengePrompt
source: Start {title}?
pt: Começar {title}?

# challengeReadyText
source: Are you ready to begin this challenge? Make sure you have enough time to complete it without interruptions.
pt: Está pronto(a) para iniciar este desafio? Certifique-se de que tem tempo suficiente para o concluir sem interrupções.

source: Not Now
pt: Agora Não

source: Daily Reminder
pt: Lembrete Diário

# takenChronowell
source: Have you taken your ChronoWell today?
pt: Já tomou o seu ChronoWell hoje?

source: Skip Today
pt: Saltar Hoje

source: Yes, Taken
pt: Sim, Já Tomei

source: Important Reminder
pt: Lembrete Importante

# takeChronowellDaily
source: Taking ChronoWell daily is crucial for optimal results. Regular use helps maintain cognitive improvement and builds lasting benefits.
pt: Tomar ChronoWell diariamente é essencial para obter resultados ideais. O uso regular ajuda a manter a melhoria cognitiva e gera benefícios duradouros.

source: I'll Take It Now
pt: Vou Tomá-lo Agora

source: Skip Anyway
pt: Saltar Mesmo Assim

# dayStreakText
source: {count} Day Streak!
pt: Sequência de {count} Dias!

# keepGoingStreak
source: Keep Going! Almost hitting a new 7 day streak!
pt: Continue assim! Está quase a atingir uma nova sequência de 7 dias!

source: Close
pt: Fechar

source: New Challenge Available
pt: Novo Desafio Disponível

source: Pattern Recognition Master
pt: Mestre em Reconhecimento de Padrões

# tryLatestExercise
source: Try our latest cognitive exercise designed to enhance your pattern recognition abilities.
pt: Experimente o nosso mais recente exercício cognitivo, concebido para melhorar as suas capacidades de reconhecimento de padrões.

# hoursAgo
source: {hours}h ago
pt: há {hours}h

# daysAgo
source: {days}d ago
pt: há {days}d

source: Weekly Report Ready
pt: Relatório Semanal Pronto

source: Performance Insights
pt: Insights de Desempenho

# weeklyReportDescription
source: Your personalized cognitive performance report for this week is now available.
pt: O seu relatório personalizado de desempenho cognitivo desta semana já está disponível.

source: January
pt: Janeiro

source: February
pt: Fevereiro

source: March
pt: Março

source: April
pt: Abril

source: May
pt: Maio

source: June
pt: Junho

source: July
pt: Julho

source: August
pt: Agosto

source: September
pt: Setembro

source: October
pt: Outubro

source: November
pt: Novembro

source: December
pt: Dezembro

# monday
source: M
pt: S

# wednesday
source: W
pt: Q

# thursday
source: T
pt: Q

# friday
source: F
pt: S

# sunday
source: S
pt: D

source: {percent}% Complete
pt: {percent}% Concluído

source: Error
pt: Erro

# failedToStartCheckIn
source: Failed to start daily check-in: {errorMessage}
pt: Falha ao iniciar o check-in diário: {errorMessage}

# improveMemoryTitle
source: How to Improve Memory - Part {part}
pt: Como Melhorar a Memória - Parte {part}

# improveMemoryDescription
source: Learn effective techniques to enhance your memory capacity and retention.
pt: Aprenda técnicas eficazes para melhorar a sua capacidade e retenção de memória.

source: Overall Score
pt: Pontuação Global

# categoryMemory
source: Memory
pt: Memória
